#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 1
a = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))
if a >= 10:
    print("Ο αριθμός", a, "είναι μεγαλύτερος ή ίσος του 10.")
print("Τέλος.")



#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 2
a = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))
if a >= 10:
print("Ο αριθμός", a, "είναι μεγαλύτερος ή ίσος του 10.")
print("Τέλος.")



#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 3
a = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))
if a > 10:
    print("Ο αριθμός", a, "είναι μεγαλύτερος του 10.")
else:
    print("Ο αριθμός", a, "είναι μικρότερος του 10.")
print("Τέλος.")



#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 4
a = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))
if a < 10 and a > 5:
    print("Ο αριθμός", a, "είναι μικρότερος του 10 και μεγαλύτερος του 5.")
else:
    print("Ο αριθμός", a, "είτε είναι μεγαλύτερος του 10 είτε μικρότερος του 5.")
print("Τέλος.")



#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 5
a = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))
if a < 10 and a > 5:
    print("Ο αριθμός", a, "είναι μικρότερος του 10 και μεγαλύτερος του 5.")
else:
print("Ο αριθμός", a, "είτε είναι μεγαλύτερος του 10 είτε μικρότερος του 5.")
print("Τέλος.")



#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 6
x = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))
if x > 0:
    print("Ο αριθμός", x, "είναι θετικός.")
elif x < 0:
    print("Ο αριθμός", x, "είναι αρνητικός.")
else:
    print("Πληκτρολογήσατε το 0.")
    
    
    
#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 7
x = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))
if x > 0:
    print("Ο αριθμός", x, "είναι θετικός.")
elif x < 0:
print("Ο αριθμός", x, "είναι αρνητικός.")
else:
    print("Πληκτρολογήσατε το 0.")


    
#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 8
day = input("Τι μέρα είναι σήμερα; ")
if day == "Δευτέρα":
    print("Καλή εβδομάδα! 5 μέρες για το Σαββατοκύριακο!")
elif day == "Τρίτη":
    print("4 μέρες για το Σαββατοκύριακο!")
elif day == "Τετάρτη":
    print("3 μέρες για το Σαββατοκύριακο!")
elif day == "Πέμπτη":
    print("2 μέρες για το Σαββατοκύριακο!")
elif day == "Παρασκευή":
    print("1 μέρα για το Σαββατοκύριακο!")
elif day == "Σάββατο" or day == "Κυριακή":
    print("Έφτασε το Σαββατοκύριακο, ξεκουραστείτε!")
else:
    print("Η μέρα που πληκτρολογήσατε δεν ήταν σωστή.")



#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 9
day = input("Τι μέρα είναι σήμερα; ")
if day == "Δευτέρα":
    print("Καλή εβδομάδα! 5 μέρες για το Σαββατοκύριακο!")
elif day == "Τρίτη":
    print("4 μέρες για το Σαββατοκύριακο!")
elif day == "Τετάρτη":
    print("3 μέρες για το Σαββατοκύριακο!")
elif day == "Πέμπτη":
    print("2 μέρες για το Σαββατοκύριακο!")
elif day == "Παρασκευή":
    print("1 μέρα για το Σαββατοκύριακο!")
elif day == "Σάββατο" or day == "Κυριακή":
    print("Έφτασε το Σαββατοκύριακο, ξεκουραστείτε!")


    
#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 10
num = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))
if num > 0:
    print("Ο αριθμός", num, "είναι θετικός.")
    if num < 5: 
        print("Ο αριθμός", num, "είναι μικρότερος του 5.")
    else:
        print("Ο αριθμός", num, "είναι μεγαλύτερος ή ίσος του 5.")
else:
    print("Ο αριθμός", num, "είναι αρνητικός ή 0.")
    if num == 0:
        print("Πληκτρολογήσατε το 0.")


    
#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 11
num = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))
if num > 0:
    print("Ο αριθμός", num, "είναι θετικός.")
    if num < 5: 
        print("Ο αριθμός", num, "είναι μικρότερος του 5.")
    else:
        print()
    print("Ο αριθμός", num, "είναι μεγαλύτερος ή ίσος του 5.")
else:
    print("Ο αριθμός", num, "είναι αρνητικός ή 0.")


    
#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 12
x = 1
if (x == 1):



#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 13
x = 1
if (x == 1):
    pass
print("Τέλος.")



#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 14
x = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))

if x > 0: print("Ο αριθμός", x, "είναι θετικός."); print("Εκτελέστηκε το μπλοκ κώδικα του if.")
elif x < 0: print("Ο αριθμός", x, "είναι αρνητικός."); print("Εκτελέστηκε το μπλοκ κώδικα του elif.")
else: print("Πληκτρολογήσατε το 0."); print("Εκτελέστηκε το μπλοκ κώδικα του else.")



#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 15
x = int(input("Πληκτρολογήστε έναν ακέραιο αριθμό: "))
print("Ο αριθμός", x, "είναι μικρότερος του 10 και μεγαλύτερος του 5.") if x < 10 and x > 5 else print("Ο αριθμός", x, "είτε είναι μεγαλύτερος του 10 είτε μικρότερος του 5.")



#01-ΘΕ-04-ΥΕ-01 ΠΑΡΑΔΕΙΓΜΑ 16
print("Το 0 αποτιμάται πάντα σε", bool(0),".")
print("Το 9 αποτιμάται πάντα σε", bool(9),".")
print("Το -5 αποτιμάται πάντα σε", bool(-5),".")
print("Το None αποτιμάται πάντα σε", bool(None),".")
#Θυμηθείτε τους χαρακτήρες διαφυγής από την προηγούμενη Υποενότητα.
print("Η κενή συμβολοσειρά \"\" αποτιμάται πάντα σε", bool(""),".") 
print("Η συμβολοσειρά \"Hello\" αποτιμάται πάντα σε", bool("Hello"),".")