##########    Συνάρτηση print()    ##########
# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 1
print('Αυτό το μήνυμα είναι μία έξοδος!')

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 2
x = 2
print('Το x έχει τιμή', x)

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 3
print(*objects, sep=' ', end='\n', file=sys.stdout, flush=False)

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 4
print(1, 2, 3, 4)
print(1, 'monty', 'python', 2, sep='#')
print(1, 2, 3, 4, sep='&', end='@')

##########    Μορφοποίηση με τον τελεστή %    ##########
# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 5
onoma = "Γιώργο"
print("Καλησπέρα, %s!" % onoma)

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 6
a = 'αποκοιμήθηκε'
print("Ο Γιώργος  %s και %s στον καναπέ"%('έφαγε', a))


# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 7
a = 'εβδομάδα'
b = 7
print('Η %s έχει %d μέρες.' %(a, b))

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 8
timi = 2.367415
print('Η τιμή του αριθμού κινητής υποδιαστολής είναι: %4.3f' %(timi))

print('Η τιμή του αριθμού κινητής υποδιαστολής είναι: %1.0f' %(timi))

##########    Μορφοποίηση με την συνάρτηση συμβολοσειρών format()    ########## 
# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 9
x , y = 4, 7
print('Η τιμή του x είναι {} και του y είναι {}'.format(x,y))

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 10
txt1 = 'Καλημέρα {0} και {1}'
txt2 = 'Καλημέρα {1} και {0}'

x = 'Γεωργία'
y = 'Κώστα'

print(txt1.format(x, y))
print(txt2.format(x, y))

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 11
txt = 'Για χαρά {onoma}, {xeretismos}'

name = 'Γεωργία'
greeting = 'τι κάνεις;'

print(txt.format(xeretismos = greeting, onoma = name))

##########    Μορφοποίηση με f-strings    ########## 
# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 12
name = 'Lola'
fruit = 'Apple'
print(f'Hello {name}! This is an {fruit}')

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 13
x, y, z = 1, 5, 2
print(f' Η αριθμητική πράξη 1*5+2 ισούται με {x * y + z}.')

##########    Concatenating strings    ##########
# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 14
x = "Monty"
y = "Python"
z = x + y
print(z)

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 15
x = "Monty"
y = "Python"
print(x, y)

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 16
x = "Python "
y = x * 3
print(y)

# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 17
x = "Monty"
y = "Python"

# Απλή συνένωση των strings
print("".join([x, y]))

# Συνένωση των strings με την κενή συμβολοσειρά
print(" ".join([x, y]))

# Συνένωση των strings με το σύμβολο & που είναι τύπου string
print("&".join([x, y]))


# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 18
x = "Python is in the top"
y = 5
z = str(5)

print("-".join([x, y]))

print("-".join([x, z]))

##########    Ήχος - Beep    ##########
# 01-ΘΕ-03-ΥΕ-03-ΠΑΡΑΔΕΙΓΜΑ 19
print('\a')
