# 01-ΘΕ-04-ΥΕ-03 ΠΑΡΑΔΕΙΓΜΑ 1
a = 4

print(a))


# 01-ΘΕ-04-ΥΕ-03 ΠΑΡΑΔΕΙΓΜΑ 2
a = 4
b = 0

print(a / b)


# 01-ΘΕ-04-ΥΕ-03 ΠΑΡΑΔΕΙΓΜΑ 3
try:
  print(z)
except:
  print('Προέκυψε μία εξαίρεση!')


# 01-ΘΕ-04-ΥΕ-03 ΠΑΡΑΔΕΙΓΜΑ 4
try:
  print(z)
except:
  print('Προέκυψε μία εξαίρεση!')
  
print('Ωστόσο, η εκτέλεση έφτασε ως το τέλος!')


# 01-ΘΕ-04-ΥΕ-03 ΠΑΡΑΔΕΙΓΜΑ 5 - Χρήση assert
print ("Το πρόγραμμα τυπώνει όλους τους ακέραιους αριθμούς")
print ("Ανάμεσα σε δύο που θα δώσετε εσείς")
print ("**********************************\n")

try:
    #Είσοδος του πρώτου αριθμού
    a = int(input("Δώσε τον 1ο αριθμό: "))
    #Είσοδος του δεύτερου αριθμού
    b = int(input("Δώσε τον 2ο αριθμό: "))
    
    #ορίζουμε το b να είναι μεγαλύτερο του a
    assert b > a
    
except ValueError:
    print('Εξαίρεση! Απαιτείται ακέραιος αριθμός!')
    
except AssertionError:
    print(f'Εξαίρεση! Δώστε αριθμό μεγαλύτερο από το {a}!')
    
else:
    print ("Ανάμεσα στο {} και στο {} υπάρχουν οι αριθμοί:".format(a,b))
    #Αύξηση του a κατά 1 ώστε να μη συμπεριλάβω τον αρχικό αριθμό
    a = a + 1

    #Εκτύπωση των αριθμών με τη δομή for
    for i in range(a,b):
        print (i)

finally:
    print('Πάντα φτάνει έως εδώ, ανεξαρτήτως εξαιρέσεων')


# 01-ΘΕ-04-ΥΕ-03 ΠΑΡΑΔΕΙΓΜΑ 6 - Χρήση raise
print ("Το πρόγραμμα τυπώνει όλους τους ακέραιους αριθμούς")
print ("Ανάμεσα σε δύο που θα δώσετε εσείς")
print ("**********************************\n")

try:
    #Είσοδος του πρώτου αριθμού
    a = int(input("Δώσε τον 1ο αριθμό: "))
    #Είσοδος του δεύτερου αριθμού
    b = int(input("Δώσε τον 2ο αριθμό: "))

    #Αν το b είναι μικρότερο του α, τότε "πετάμε" εξαίρεση
    if(b < a):
        raise Exception(f'Εξαίρεση! Δώστε αριθμό μεγαλύτερο από το {a}!')
    
except ValueError:
    print('Εξαίρεση! Απαιτείται ακέραιος αριθμός')
    
else:
    print ("Ανάμεσα στο {} και στο {} υπάρχουν οι αριθμοί:".format(a,b))
    #Αύξηση του a κατά 1 ώστε να μη συμπεριλάβω τον αρχικό αριθμό
    a = a + 1

    #Εκτύπωση των αριθμών με τη δομή for
    for i in range(a,b):
        print (i)

finally:
    print('Πάντα φτάνει έως εδώ, ανεξαρτήτως εξαιρέσεων')


# 01-ΘΕ-04-ΥΕ-03 ΠΑΡΑΔΕΙΓΜΑ 7 - Debugging
message = "Καλημέρα"
new_message = "_"

for i in range(len(message)):
    new_message = message[i] + "_"
print(new_message)


# 01-ΘΕ-04-ΥΕ-03 ΠΑΡΑΔΕΙΓΜΑ 8 - Debugging
message = "Καλημέρα"
new_message = "_"

for i in range(len(message)):
    new_message += message[i] + "_"
print(new_message)

