#σε αυτό το παράδειγμα θα δημιουργήσουμε συναρτήσεις
#θα δείχνουν πως λειτουργει ενα ατμ
#βασικές λειτουργίες
#1 Αρχικό μενου στοιχεία τράπεζας
#2 Έλεγχος pin
#3 Κεντρικό μενού χρήστη
#4 ανάληψη
#5 κατάθεση
#6 υπόλοιπο
#7 ακύρωση
#Συνάρτηση Αρχικό μενού
def start_menu():
    print("----Γεια σας---- αυτό είναι το ατμ της τράπεζας μας----")
    pin=int(input("Πληκτρολογήστε κωδικό PIN: "))
    if check_pin(pin):
        print("Pin OK")
    else:
        print("Λάθος PIN")
#δημιουργούμε ένα λεξικό για να αποθηκευσουμε τα στοιχεία χρήστη
user={
    'lastname': 'Monty',
    'pin':1234,
    'balance':5000
    }
#έλεγχος εγκυρότητας PIN
def check_pin(pin):
    if pin==user['pin']:
        return True
    else:
        return False
start_menu()    

