#σε αυτό το παράδειγμα χρησιμοποιούμε break για να νγει από το βρόχο επανάληψης
print("Υπολογισμός γινομένου 10 αριθμών")
print("Αν ένας από τους αριθμούς ειναι 0 ο υπολογισμός τερματίζεται")
print("===========================================================\n")
ginomeno=1
print("Θα δώσεις 10 αριθμούς για να υπολογίσω το γινόμενο τους")
print("Αν γράψεις λιγότερους από 10 αριθμούς και μετά δώσεις 0 θα υπολογίσω ")
print("το γινόμενο όσων αριθμών έδωσες πριν από το 0 ")
for i in range(1,11):
    a=int(input("Δώσε τον {}-o αριθμό: ".format(i)))
    
    if a==0:
        break
    ginomeno*=a
print("το γινόμενο των αριθμών που έδωσες (χωρίς το 0) είναι: ",ginomeno)
     
