#σε αυτό το παράδειγμα έχουμε διάφορα σύνολα
#συγκρίνουμε τιμές και μετά εμφανίζονται τα αποτελέσματα
#Τα αρχικά δεδομένα δίνονται σε ένα string
#διαχωρίζουμε το string σε σύνολα
data ="""Δημήτρης,M,Αγγλικά,Μαθηματικά,Φυσική
Αντώνης,M,Μαθηματικά,Φυσική,Έκθεση
Δήμητρα,F,Μαθηματικά,Φυσική,Έκθεση,Αγγλικά
Κική,F,Μαθηματικά
Ειρήνη,F,Μαθηματικά,Φυσική,Έκθεση,Αγγλικά
Δέσποινα,F,Έκθεση,Αγγλικά
Σοφία,F,Μαθηματικά,Αγγλικά
Γιώργος,M,Αγγλικά
Γεωργία,F,Φυσική,Αγγλικά
Αλέξανδρος,M,Μαθηματικά,Φυσική,Έκθεση,Αγγλικά
Αλέξης,M,Φυσική,Έκθεση
Μαρία,F,Φυσική,Έκθεση,Αγγλικά
Βασίλης,M,Έκθεση,Αγγλικά
Ιουλία,F,Μαθηματικά,Έκθεση
Ελένη,F,Μαθηματικά,Φυσική"""
#το μετατρέπω σε λίστα ανά γραμμή
lines=data.split("\n")
print(lines)
#Θα δημιουργήσουμε μερικά κενά σύνολα sets
#για να διαχωρίσουμε τα στοιχεία
#απο κάθε γραμμή σε αντίστοιχα σύνολα
m=set()
f=set()
agglika=set()
mathimatika=set()
fysiki=set()
ekthesi=set()
for line in lines:
    s=line.split(",")
    mathitis=s[0]
    fylo=s[1]
    if "M" in fylo:
        m.add(mathitis)
    if "F" in fylo:
        f.add(mathitis)
    if "Αγγλικά" in s:
        agglika.add(mathitis)
    if "Μαθηματικά" in s:
        mathimatika.add(mathitis)
    if "Έκθεση" in s:
        ekthesi.add(mathitis)
    if "Φυσική" in s:
        fysiki.add(mathitis)       
#ονόματα που αντιστοιχούν σε κάθε σύνολο
print("Το φροντιστήριο εχει {} αγόρια και {} κορίτσια\n ".format(len(m),len(f)))
print("---------------------------------------------------------")
print("Αγγλικά παρακολουθούν οι μαθητές: ",agglika)
print("{} μαθητές παρακολουθούν αγγλικά: ".format(len(agglika)))
print("---------------------------------------------------------")
print("Μαθηματικά παρακολουθούν οι μαθητές: ",mathimatika)
print("{} μαθητές παρακολουθούν μαθηματικά: ".format(len(mathimatika)))
print("---------------------------------------------------------")
print("Φυσική παρακολουθούν οι μαθητές: ",fysiki)
print("{} μαθητές παρακολουθούν φυσική: ".format(len(fysiki)))
print("---------------------------------------------------------")
print("Έκθεση: ",ekthesi)
print("{} μαθητές παρακολουθούν έκθεση: ".format(len(ekthesi)))
print("---------------------------------------------------------")
q3=agglika.intersection(mathimatika)
print("Αγγλικά και Μαθηματικά παρακολουθούν οι μαθητές: ",agglika.intersection(mathimatika))
print("{} μαθητές παρακολουθούν Μαθηματικά και Αγγλικά: ".format(len(q3)))
print("---------------------------------------------------------")
q4=agglika.union(ekthesi)
print("Είτε Αγγλικά είτε Έκθεση παρακολουθούν οι μαθητές: ",agglika.union(ekthesi))
print("{} μαθητές παρακολουθούν ειτε Αγγλικά ειτε Έκθεση".format(len(q4)))
print("---------------------------------------------------------")
q5_a=fysiki.difference(mathimatika)
q5=q5_a.intersection(f)
print("Φυσική αλλά όχι μαθηματικά παρακολουθούν τα κορίτσια: ",fysiki.difference(mathimatika).intersection(f))
print("{} μαθήτριες παρακολουθούν Φυσική αλλά οχι Μαθηματικά ".format(len(q5)))
for x in q5:
    print (x)
print("-------------------------------------------------------------------")
print("{} συνολικά μαθητές παρακολουθούν Φυσική αλλά οχι Μαθηματικά ".format(len(q5_a)))
for y in q5_a:
    print(y)
print("-------------------------------------------------------------------")
    
    
    
    
       
