#Σε αυτό το παράδειγμα θα διαχωρίσουμε ένα string σε δύο μέρη
str="Hello. This is a test. I repeat, a test. Bye now."
#Είναι αρχική συμβολοσειρά για να κάνουμε τις δοκιμές
#και μετά μπορεί να αλλάξει η συμβολοσειρά σε μία άλλη που δίνει ο χρήστης
print("-----1ος τρόπος διαχωρισμού string με βάση τον μεσαίο χαρακτήρα-----")
print("το μέσο της συμβολοσειράς ακριβώς ειναι o: ", len(str)/2, "-ος χαρακτήρας")
print("""το ακέραιο μέρος του μέσου της συμβολοσειράς ειναι ο: """,
      int(len(str)/2),"-ος χαρακτήρας")
#ο χαρακτήρας n ειναι το μέσο όμως η αρίθμηση
#αρχίζει από το 0 και παιρνουμε τη θέση n-1
print( "Ο χαρακτήρας αυτός είναι:", str[int(len(str)/2)-1],
       "και βρίσκεται στη θέση [",int(len(str)/2)-1,"]της συμβολοσειράς")
print("διαχωρισμός συμβολοσειράς σε δύο μέρη")
print(str[0:int(len(str)/2)])
print(str[int(len(str)/2):])

print("""----2ος τρόπος διαχωρισμού string με βάση
την τελευταία τελεία πριν τον μεσαίο χαρακτήρα-----""")
midpoint=int(len(str)/2)
print("Ο μεσαίος χαρακτήρας στη συμβολοσειρά έχει το ακέραιο μέρος που είναι",midpoint)
print("""ο στόχος μας ειναι να βρούμε μία τελεία και ένα κενό
πριν τον μεσαιο χαρακτήρα ώστε εκει γίνεται η αλλαγή πρότασης""")
target_pos=str.rfind(". ",0,midpoint)
print(""" το τελευταίο κενό πρίν τη μέση ειναι στη θέση [""",target_pos,"]")
print(""" αυτό το σημείο διαχωρισμού μετά από το κενό ειναι στη θέση [""",target_pos+1,"]")
#κόβουμε τη συμβολοσειρά από την αρχή μέχρι
#μετά την τελεία και το κενό που ειναι πιο κοντά στη μέση
print(str[0:target_pos+1])
#το άλλο μισό θα ειναι από την επόμενη θέση μέχρι τέλος
print(str[target_pos+2:])

