#σε αυτό το παράδειγμα ο χρήστης εισάγει μία συμβολοσειρά
#διαχωρίζουμε την συμβολοσειρά σε δύο μέρη
#με βάση την τελεία και το κενό κοντά στο μέσο
str=input("δώσε ένα κείμενο")
midpoint=int(len(str)/2)
print ("το ακέραιο μέρος του μέσου είναι:",midpoint,"και βρίσκεται στη θέση[",midpoint-1,"]")
target_pos=str.rfind(". ",0,midpoint)
print("η τελεία πριν το μέσο βρίσκεται στη θέση [",target_pos,"]")
print("το κενό πριν το μέσο βρίσκεται στη θέση[",target_pos+1,"]")
print(str[0:target_pos+1])
print(str[target_pos+2:])
