#σε αυτό το παράδειγμα θα δημιουργήσουμε λεξικά        
#Θα προσθέσουμε νέο ζεύγος με εντολές  ειτε με τη μέθοδο update()
print("----Πρώτο Λεξικό---")
students = {
    "names":["Άννα","Γιώργος","Βασιλική","Δημήτρης"],
    "age":[10,13,34,56]
}
print('Εμφανίζουμε τα στοιχεία του λεξικού:')
for x in students.items():
    print(x)
print('\n')
students['class']=["Μαθηματικά","Αγγλικά","Φυσική","Χημεία"]
print('Εμφανίζουμε τα στοιχεία του λεξικού μετά την προσθήκη του νέου ζεύγους')
for x in students.items():
    print(x)
print('\n')    
students.update({'names':['Νίκη','Γιώργος','Βασιλική','Δημήτρης'],'grades':[19.0,20,18.5,19]})
print('Εμφανίζουμε τα στοιχεία του λεξικού μετά τις αλλαγές στα στοιχεία του κλειδιού names')
for x in students.items():
    print(x)
