#σε αυτό το παράδειγμα θα δημιουργήσουμε ένα λεξικό που θα εχει
#εμφωλευμένα λεξικά εντός του λεξικού
#Θα δώσουμε τα θέματα ενός σεμιναρίου ως τιμές στο λεξικό
print("----Εμφωλευμένα Λεξικά---")
seminario = {
    1:
       {"title": "Εισαγωγή στην Python",
        "subsections": {
        "titles":["Εισαγωγή στην Python","Μεταβλητές, τελεστές και πράξεις","Είσοδος έξοδος και συμβολοσειρές",
                  "Δομές ελέγου και επανάληψης - Αποσφαλμάτωση"],
         "duration":["1 εβδομάδα","1 εβδομάδα","1 εβδομάδα","2 εβδομάδες"]}},               
     2:
        {"title":"Προχωρημένος προγραμματισμός Python",
         "subsections": {
         "titles": ["Δομές Δεδομένων","Δομημένος Προγραμματισμός","Συναρτήσεις","Διαχείριση Αρχείων",
                     "Εβδομάδα Μελέτης"],
           "duration":['2 εβδομάδες','2 εβδομάδες','1 εβδομάδα','1 εβδομάδα']}},
      3:
        {"title": "Δημιουργία ολοκληρωμένων εφαρμογών με Python - Πρακτικές Εφαρμογές",
         "subsections":
         {"titles": ['Πρώτη Εφαρμογή','Δεύτερη Εφαρμογή','Εβδομάδα Μελέτης'],
            "duration": ['2 εβδομάδες','2 εβδομάδες','1 εβδομάδα']}}
}
print('Εμφανίζουμε τα στοιχεία του λεξικού:')
print("Το σεμινάριο θα έχει {} θεματικές ενότητες.\n".format(len(seminario)))
print('\n')
for x,y in seminario.items():
    print('Ο τίτλος της {}ης ΘΕ είναι {}.'.format(x,y['title']))
    print('Οι υποενότητες της ΘΕ ειναι: ')
    print(y['subsections']['titles'])
    print("Η διάρκεια τους είναι ")
    print(y['subsections']['duration'])
    print('\n')
