#σε αυτό το παράδειγμα θα δημιουργήσουμε λεξικά        
#Θα έχουμε πρόσβαση στα στοιχεία του λεξικού
print("----Πρώτο Λεξικό---")
fruit1= {
    "type":"μήλα",
    "shape":"στρογγυλά",
    "color": ["Κόκκινα","Πράσινα","Κίτρινα"],
    "quantity": [40,20,10],
    "isEdible": True
}
print("Χρώματα ",fruit1['color'])
print("είναι βρώσιμο;",fruit1['isEdible'])
print("σχήμα ",fruit1['shape'])
print("Είδος ",fruit1.get('type'))
print("σχήμα ",fruit1.get("shape"))
print("Ποσότης ",fruit1.get("quantity"))
print("Το πλήθος των αντικειμένων του πρώτου λεξικού ειναι {} και ο τύπος ειναι {}".format(len(fruit1),type(fruit1)))
print('Τα κλειδιά του λεξικού είναι: ',fruit1.keys())
print("=====================---Δεύτερο Λεξικό---=========================")
kleidia=fruit1.keys()
print("τα κλειδιά του λεξικού είναι: ",kleidia,'\n')
fruit1['new']='Προσθέτουμε ένα νέο χαρακτηριστικό'
print('Προστέθηκε το νέο ζεύγος.')
print('Τα νέα κλειδιά του λεξικού τώρα ειναι: ',kleidia)
times=fruit1.values()
print('Οι τιμές του λεξικού είναι: ',times,'\n')
fruit1['origin']=["Τριπόλεως","Φιρίκι","Ζαγορίν"]
print('Προστέθηκε πάλι ένα νέο ζευγος')
print('Οι τιμές του λεξικού τώρα έγιναν: ',times)

