#Σε αυτό το παράδειγμα θα χρησιμοποιήσουμε εντολές της Python
#που ανοίγουν και κλείνουν αρχεία.
#χρησιμοποιούμε ένα αρχείο example_2.txt που βρίσκεται στον ιδιο φάκελο
#ανοίγουμε το αρχείο σε λειτουργία προσθήκης "a" προσθέτει στο τέλος τα νέα στοιχεία
#ανοίγουμε το αρχείο σε λειτουργία αποκλειστικής δημιουργίας "Χ"
#Δημιουργεί νέο αρχείο κενό. Εμφανίζει σφάλμα αν το αρχείο υπάρχει ήδη.
with open("example_2.txt","x",encoding="utf-8") as f:
    f.write("---δημιουργία και εγγραφή νέου αρχείου με την λειτουργία 'x' --- ")
with open("example_2.txt",encoding="utf-8")as f:
    print(f.read())
