#σε αυτό το παράδειγμα θα δημιουργήσουμε συναρτήσεις
#με μεταβλητές που είναι ορατές μόνο μέσα στις συναρτήσεις
#και στο εξωτερικό πρόγραμμα αα βάλουμε μία άλλη μεταβλητή με το ίδιο όνομα
#και τότε οι μεταβλητές με το ίδιο όνομα
#θα είναι 2 ξεχωριστές οντότητες
#με τη λέξη κλειδί global θα επεξεργαστούμε την τιμή μίας καθολικής μεταβλητής
#εντός του υποπρογράμματος
a=100
def my_f():
    global a
    a-=80
    print("εντός της 1ης συνάρτησης ")
    print(f"Η τιμή του a είναι: {a} ")
    def power():
        print("εντός της 2ης συνάρτησης ")
        print("το a υψωμένο στη 2η δύναμη είναι: {} ".format(a**2))
        global x
        x='Αυτή είναι μία μεταβλητή χ καθολικής εμβέλειας'
    power()
print(f'Στο εξωτερικό πρόγραμμα η αρχική τιμή του a θα ειναι: {a}\n')
my_f()
print("η τελική τιμή του a στο εξωτερικό πρόγραμμα θα εμφανιστεί οτι είναι: {} ".format(a))
print(x)
