#σε αυτό το παράδειγμα θα δημιουργήσουμε συναρτήσεις
#με γενικές μεταβλητές που είναι ορατές σε οποιοδήποτε μέρος του κώδικα
#εντός και εκτός μίας συνάρτησης
a=100
def my_f():
    print("εντός της 1ης συνάρτησης ")
    print("Η τιμή του a είναι: {} ".format(a))
    def power():
        print("εντός της 2ης συνάρτησης ")
        print("το a υψωμένο στη 2η δύναμη είναι: {} ".format(a**2))
    power()
my_f()
print(f'Στο εξωτερικό πρόγραμμα η τιμή του a θα ειναι: {a}')
print("με άλλο τρόπο η τιμή του a θα εμφανιστεί οτι είναι: {} ".format(a))
