#σε αυτό το παράδειγμα θα αλλάξουμε τα στοιχεία μιας λίστας με τελεστές + και *
list_a=['Python',5,'Μήλο',9.3,'Μπανάνα',6,77,4.5]
list_b=["Γιώργος","Ελέφαντας",7,"Μαρία","Μανώλης",5,"Ραδιόφωνο",4.2,"Κώστας",44]
mikosa=len(list_a)
mikosb=len(list_b)
print('list_a:',list_a,'\n')
print(f"το μήκος της λίστας a είναι {mikosa}",'\n')
print('list_b:',list_b)
print(f"το μήκος της λίστας b είναι {mikosb}",'\n')
print('----ένωση και των δύο λίστων---------')
print(list_a+list_b,'\n')
print('----Προσθήκη ενός στοιχείου στην list_a-------')
print(list_a + ['Python'],'\n')
print('----Πολλαπλασιασμός επί 3 της list_a-------')
print(list_a * 3)


