#σε αυτό το παράδειγμα θα χρησιμοποιήσυμε την εντολή raise αντί για assert
print("Θα δώσετε δύο ακέραιους αριθμούς")
print("Θα εμφανίσω όλους τους ακέραιους ανάμεσα σε αυτούς")
print("+++++++++++++++++++++++++++++++++++++++++++++++++++\n")
try:
    a=int(input("Δώσε τον 1ο αριθμό: "))
    b=int(input("Δώσε τον 2ο αριθμό: "))
    if(b<a):
        raise Exception(f"Εξαίρεση! Δώστε αριθμό μεγαλύτερο από το {a} ")
except ValueError:
    print("Eξαίρεση! Απαιτείται ακέραιος αριθμός: ")
else:
    print("ανάμεσα στο {} και στο {} υπάρχουν οι αριθμοί: ".format(a,b))
    a=a+1
    for i in range(a,b):
        print(i)
finally:
    print('Πάντα φτάνει εδώ ανεξάρτητα από τις εξαιρέσεις')
    
    
    
