#σε αυτό το παράδειγμα έχουμε δύο σύνολα sets
#Θα βρούμε τη διαφορά συνόλων Α-Β
#Θα χρησιμοποιήσουμε το difference_update()
#αλλάζει το σύνολο στο οποίο εφαρμόζεται
print("---------Σύνολο 1 ---------------- ")
first_set={"a","b","c","d"}
print("Πρώτο σύνολο: ",first_set,"Πλήθος Στοιχειων: ",len(first_set))
print("---------Σύνολο 2 ---------------- ")
second_set={"a","b",1,2,3,4}
print("Δευτερο σύνολο: ",second_set,"Πλήθος Στοιχειων: ",len(second_set))
first_set.difference_update(second_set)
print("---------Έγινε η Διαφορά συνόλων---------------- ")
print("Το σύνολο διαφορά Α-Β ειναι : ")
print("To σύνολο1 είναι : ",first_set,"Πλήθος Στοιχειων: ",len(first_set))
print("To σύνολο2 είναι : ",second_set,"Πλήθος Στοιχειων: ",len(second_set))






