#σε αυτό το παράδειγμα έχουμε δύο σύνολα sets
#τα κοινά στοιχεία θα αποθηκευτούν σε ένα 3ο σύνολο
#Θα χρησιμοποιήσουμε το intersection()
#Τα κοινά στοιχεία των δύο συνόλων εμφανίζονται μόνο μία φορά στο νέο σύνολο
print("---------Σύνολο 1 ---------------- ")
first_set={"a","b","c","d"}
print("Πρώτο σύνολο: ",first_set,"Πλήθος Στοιχειων: ",len(first_set))
print("---------Σύνολο 2 ---------------- ")
second_set={"a","b",1,2,3,4}
print("Δευτερο σύνολο: ",second_set,"Πλήθος Στοιχειων: ",len(second_set))
intersect_set=first_set.intersection(second_set)
print("---------Έγινε η τομή των 2 συνόλων ---------------- ")
print("Το νεο σύνολο intersection ειναι τώρα: ",intersect_set,"Πλήθος στοιχείων ",len(intersect_set))
print("Πρώτο σύνολο μετά την τομή: ",first_set,"Πλήθος Στοιχειων: ",len(first_set))
print("Δευτερο σύνολο μετά την τομή: ",second_set,"Πλήθος Στοιχειων: ",len(second_set))





