#σε αυτό το παράδειγμα έχουμε 3 σύνολα sets
#Θα βρούμε αν ένα σύνολο ειναι υποσύνολο του άλλου
#Θα χρησιμοποιήσουμε το issubset()
#θα βρούμε αν ένα σύνολο είναι υπερσύνολο του άλλου
#θα χρησιμοποιήσουμε το issuperset()
print("-------Σύνολο myset---------------")
myset={"a","b","c","d","e","f","g","h"}
print("Το κύριο σύνολο είναι ",myset,"Πλήθος στοιχειων ",len(myset))
print("---------Σύνολο 1 ---------------- ")
first_set={"a","b","c","d"}
print("Πρώτο σύνολο: ",first_set,"Πλήθος Στοιχειων: ",len(first_set))
print("---------Σύνολο 2 ---------------- ")
second_set={"a","b",1,2,3,4}
print("Δευτερο σύνολο: ",second_set,"Πλήθος Στοιχειων: ",len(second_set))
print("είναι το 1ο σύνολο υποσύνολο του κυρίου συνολου; ",first_set.issubset(myset))
print("είναι το 2ο σύνολο υποσύνολο του κυρίου συνολου; ",second_set.issubset(myset))
print("Το κύριο σύνολο περιέχει όλα τα στοιχεία του 1ου συνόλου; ",myset.issuperset(first_set))
print("Το κύριο σύνολο περιέχει όλα τα στοιχεία του 2ου συνόλου; ",myset.issuperset(second_set))







