#σε αυτό το παράδειγμα έχουμε δύο σύνολα sets
#τα κοινά στοιχεία θα αποθηκευτούν στο 1ο σύνολο
#Θα χρησιμοποιήσουμε το intersection_update()
#Τα κοινά στοιχεία των δύο συνόλων θα εμφανίζονται μόνο μία φορά στο 1o σύνολο
print("---------Σύνολο 1 ---------------- ")
first_set={"a","b","c","d"}
print("Πρώτο σύνολο: ",first_set,"Πλήθος Στοιχειων: ",len(first_set))
print("---------Σύνολο 2 ---------------- ")
second_set={"a","b",1,2,3,4}
print("Δευτερο σύνολο: ",second_set,"Πλήθος Στοιχειων: ",len(second_set))
first_set.intersection_update(second_set)
print("---------Έγινε η τομή των 2 συνόλων ---------------- ")
print("Το νεο σύνολο 1 μετά την τομή ειναι : ",first_set,"Πλήθος στοιχείων ",len(first_set))
print("\n")
print("Δευτερο σύνολο μετά την τομή: ",second_set,"Πλήθος Στοιχειων: ",len(second_set))





