#σε αυτό το παράδειγμα θα ενώσουμε δύο σύνολα sets
#και η αλλαγή θα αποθηκευτεί σε ένα 3ο σύνολο
#Θα χρησιμοποιήσουμε το union()
print("---------Σύνολο 1 ---------------- ")
first_set={"a","b","c","d","e","f","g"}
print("Πρώτο σύνολο: ",first_set,"Πλήθος Στοιχειων: ",len(first_set))
print("---------Σύνολο 2 ---------------- ")
second_set={"John","Jason","k","Jack",10,2,5}
print("Δευτερο σύνολο: ",second_set,"Πλήθος Στοιχειων: ",len(second_set))
union_set=first_set.union(second_set)
print("---------Έγινε η ένωση των 2 συνόλων ---------------- ")
print("Το νεο σύνολο union ειναι τώρα: ",union_set,"Πλήθος στοιχείων ",len(union_set))
print("Πρώτο σύνολο μετά την ενωση: ",first_set,"Πλήθος Στοιχειων: ",len(first_set))
print("Δευτερο σύνολο μετά την ενωση: ",second_set,"Πλήθος Στοιχειων: ",len(second_set))





