#σε αυτό το παράδειγμα θα βάλουμε try except, assert και else και finally
print("Θα δώσεις 2 ακέραιους και θα εμφανίσω όλους τους ακέραιους")
print("ανάμεσα σε αυτούς τους δύο που έδωσες")
print("===========================================================\n")
try:
    a=int(input("δώσε τον 1ο αριθμό: "))
    b=int(input("δώσε τον 2ο αριθμό: "))
    assert b>a
except ValueError:
    print("Εξαίρεση! Απαιτείται ακέραιος αριθμός")
except AssertionError:
    print(f"Εξαίρεση! Ο 2ος αριθμός πρέπει να είναι μεγαλύτερος από το {a}")
else:
    print("ανάμεσα στον αριθμό {} και στον {} υπάρχουν οι ακέραιοι : ".format(a,b))
    a=a+1
    for i in range(a,b):
        print(i)
finally:
    print("Πάντα φτάνει ως εδώ ανεξαρτήτως εξαιρέσεων")
    
