#σε αυτό το παράδειγμα θα έχουμε αποδόμηση μίας πλειάδας
#κάνουμε ανάθεση των στοιχείων της πλειάδας σε μεταβλητές
#αν το πλήθος των μεταβλητών δεν είναι ισο με το πλήθος των στοιχείων
#χρησιμοποιούμε *

print("=====Έναρξη========",'\n')
print("-------Δημιουργία Πλειάδας-----------")
mytuple=('Python',5,'Μήλο',9.3,'Μπανάνα')
print('Πλειάδα ',mytuple)
print('τύπος ',type(mytuple),'\n')
print("-----αποδόμηση πλειάδας---------------")
print("---όταν πλήθος στοιχειων ειναι ίσο με το πλήθος μεταβλhτών-------")
a,b,c,d,e=mytuple
print('a= ',a, '\t=>', "τύπος ",type(a))
print('b= ',b, '\t\t=>', "τύπος ",type(b))
print('c= ',c, '\t=>', "τύπος ",type(c))
print('d= ',d, '\t=>', "τύπος ",type(d))
print('e= ',e, '\t=>', "τύπος ",type(e),'\n')
print("----------όταν το πλήθος στοιχείων είναι μεγαλύτερο από το πλήθος μεταβλητών------------")
print("----------εδώ βάζουμε στην τελευταία μεταβλητή τον αστερίσκο *----------------------")
x,y,*z=mytuple
print('x= ',x, '\t\t\t=>','τύπος ',type(x))
print('y= ',y, '\t\t\t\t=>','τύπος ',type(y))
print('z= ',z,'\t=>','τύπος ',type(z),'\n')
print("ο αστερίσκος μπορεί να μπει σε αλλη μεταβλητή και όχι στην τελευταία μεταβλητή----------")
k,*l,m,n=mytuple
print('k= ',k,'\t=>','τύπος ',type(k))
print('l= ',l,'\t=>','τύπος ',type(l))
print('m= ',m,'\t=>','τύπος ',type(m))
print('n= ',n,'\t=>','τύπος ',type(n))

